from task15_5.task5 import favorite_films


def test_favorite_films_is_in_the_list():
    assert (
        favorite_films(
            [
                "Крепкий орешек",
                "Назад в будущее",
                "Таксист",
                "Леон",
                "Богемская рапсодия",
                "Город грехов",
                "Мементо",
                "Отступники",
                "Деревня",
            ],
            ["Леон", "Таксист", "Варвара", "Деревня"],
        )
        == ["Леон", "Таксист", "Деревня"]
    )


def test_favorite_films_isnt_in_the_list():
    assert (
        favorite_films(
            [
                "Крепкий орешек",
                "Назад в будущее",
                "Таксист",
                "Леон",
                "Богемская рапсодия",
                "Город грехов",
                "Мементо",
                "Отступники",
                "Деревня",
            ],
            ["Форсаж", "Боксер", "Бэтмэн"],
        )
        == []
    )
